Revit 2027 API
ParameterTypeId.StairsSupporttypeTopsideSurface Property
 "Topside Surface": Topside Surface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsSupporttypeTopsideSurface { get; }
Public Shared ReadOnly Property StairsSupporttypeTopsideSurface As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsSupporttypeTopsideSurface {
	ForgeTypeId^ get ();
}
static member StairsSupporttypeTopsideSurface : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace